tests/Unit/Api/Subscriptions/data/responses/subscription_imported_for_items.json

{
    "customer": {
        "allow_direct_debit": false,
        "auto_collection": "off",
        "card_status": "no_card",
        "created_at": 1517505319,
        "deleted": false,
        "excess_payments": 0,
        "first_name": "John",
        "id": "__test__8asukSOXdvWPP6",
        "last_name": "Doe",
        "net_term_days": 0,
        "object": "customer",
        "pii_cleared": "active",
        "preferred_currency_code": "USD",
        "promotional_credits": 0,
        "refundable_credits": 0,
        "resource_version": 1517505319325,
        "taxability": "taxable",
        "unbilled_charges": 0,
        "updated_at": 1517505319
    },
    "subscription": {
        "activated_at": 1517505319,
        "billing_period": 1,
        "billing_period_unit": "month",
        "charged_items": [
            {
                "item_price_id": "ssl-charge-USD",
                "last_charged_at": 1516295719,
                "object": "charged_item"
            },
            {..}
        ],
        "created_at": 1517505319,
        "currency_code": "USD",
        "current_term_end": 1614018600,
        "current_term_start": 1517505319,
        "customer_id": "__test__8asukSOXdvWPP6",
        "deleted": false,
        "due_invoices_count": 0,
        "has_scheduled_changes": false,
        "id": "__test__8asukSOXdvbfP9",
        "mrr": 0,
        "next_billing_at": 1614018600,
        "object": "subscription",
        "resource_version": 1517505319739,
        "started_at": 1517505319,
        "status": "active",
        "subscription_items": [
            {
                "amount": 1000,
                "free_quantity": 0,
                "item_price_id": "basic-USD",
                "item_type": "plan",
                "object": "subscription_item",
                "quantity": 1,
                "unit_price": 1000
            }
        ],
        "updated_at": 1517505319
    }
}