tests/Unit/Api/Subscriptions/data/responses/subscription_invoice.json

{
    "adjustment_credit_notes": [],
    "amount_adjusted": 0,
    "amount_due": 0,
    "amount_paid": 2000,
    "amount_to_collect": 0,
    "applied_credits": [],
    "base_currency_code": "USD",
    "billing_address": {
        "first_name": "John",
        "last_name": "Mathew",
        "object": "billing_address",
        "validation_status": "not_validated"
    },
    "credits_applied": 0,
    "currency_code": "USD",
    "customer_id": "__test__KyVkkWS1xLskm8",
    "date": 1517463749,
    "deleted": false,
    "due_date": 1517463749,
    "dunning_attempts": [],
    "exchange_rate": 1,
    "first_invoice": true,
    "has_advance_charges": false,
    "id": "__demo_inv__1",
    "is_gifted": false,
    "issued_credit_notes": [],
    "line_items": [{
        "amount": 2000,
        "customer_id": "__test__KyVkkWS1xLskm8",
        "date_from": 1517463749,
        "date_to": 1517463749,
        "description": "SSL Charge USD Monthly",
        "discount_amount": 0,
        "entity_id": "ssl-charge-USD",
        "entity_type": "charge_item_price",
        "id": "li___test__KyVkkWS1xLt9LF",
        "is_taxed": false,
        "item_level_discount_amount": 0,
        "object": "line_item",
        "pricing_model": "flat_fee",
        "quantity": 1,
        "tax_amount": 0,
        "tax_exempt_reason": "tax_not_configured",
        "unit_amount": 2000
    }],
    "linked_orders": [],
    "linked_payments": [{
        "applied_amount": 2000,
        "applied_at": 1517463750,
        "txn_amount": 2000,
        "txn_date": 1517463750,
        "txn_id": "txn___test__KyVkkWS1xLtFiG",
        "txn_status": "success"
    }],
    "net_term_days": 0,
    "new_sales_amount": 2000,
    "object": "invoice",
    "paid_at": 1517463750,
    "price_type": "tax_exclusive",
    "recurring": false,
    "resource_version": 1517463750000,
    "round_off_amount": 0,
    "shipping_address": {
        "city": "Walnut",
        "country": "US",
        "first_name": "John",
        "last_name": "Mathew",
        "object": "shipping_address",
        "state": "California",
        "state_code": "CA",
        "validation_status": "not_validated",
        "zip": "91789"
    },
    "status": "paid",
    "sub_total": 2000,
    "tax": 0,
    "term_finalized": true,
    "total": 2000,
    "updated_at": 1517463750,
    "write_off_amount": 0
}