tests/Unit/Api/Subscriptions/data/responses/subscription_resumed.json

{
  "card": {
    "card_type": "visa",
    "customer_id": "5SK0b4wlQo95kck8R",
    "expiry_month": 1,
    "expiry_year": 2032,
    "funding_type": "credit",
    "gateway": "chargebee",
    "gateway_account_id": "gw_5SK0b4wlQo94FjJ2",
    "iin": "411111",
    "last4": "1111",
    "masked_number": "************1111",
    "object": "card",
    "payment_source_id": "pm_5SK0b4wlQo95keX8T",
    "status": "valid"
  },
  "customer": {
    "allow_direct_debit": false,
    "auto_collection": "on",
    "card_status": "valid",
    "created_at": 1522747124,
    "deleted": false,
    "email": "joe@user.com",
    "excess_payments": 0,
    "first_name": "Joe",
    "id": "5SK0b4wlQo95kck8R",
    "last_name": "D",
    "net_term_days": 0,
    "object": "customer",
    "payment_method": {
      "gateway": "chargebee",
      "gateway_account_id": "gw_5SK0b4wlQo94FjJ2",
      "object": "payment_method",
      "reference_id": "tok_5SK0b4wlQo95keT8S",
      "status": "valid",
      "type": "card"
    },
    "preferred_currency_code": "USD",
    "primary_payment_source_id": "pm_5SK0b4wlQo95keX8T",
    "promotional_credits": 0,
    "refundable_credits": 0,
    "resource_version": 1522747125000,
    "taxability": "taxable",
    "unbilled_charges": 0,
    "updated_at": 1522747125
  },
  "invoice": {
    "adjustment_credit_notes": [],
    "amount_adjusted": 0,
    "amount_due": 0,
    "amount_paid": 3190,
    "amount_to_collect": 0,
    "applied_credits": [],
    "base_currency_code": "USD",
    "billing_address": {
      "first_name": "Joe",
      "last_name": "D",
      "object": "billing_address",
      "validation_status": "not_validated"
    },
    "credits_applied": 0,
    "currency_code": "USD",
    "customer_id": "5SK0b4wlQo95kck8R",
    "date": 1522747126,
    "deleted": false,
    "due_date": 1522747126,
    "exchange_rate": 1,
    "first_invoice": false,
    "has_advance_charges": false,
    "id": "50",
    "issued_credit_notes": [],
    "line_items": [
      {
        "amount": 3000,
        "date_from": 1522747126,
        "date_to": 1525339126,
        "description": "No Trial",
        "discount_amount": 0,
        "entity_id": "no_trial",
        "entity_type": "plan",
        "id": "li_XpbG6h6Qo95l1x3F",
        "is_taxed": false,
        "item_level_discount_amount": 0,
        "object": "line_item",
        "quantity": 3,
        "subscription_id": "5SK0b4wlQo95kck8R",
        "tax_amount": 0,
        "tax_exempt_reason": "tax_not_configured",
        "unit_amount": 1000
      }
    ],
    "linked_orders": [],
    "linked_payments": [
      {
        "applied_amount": 3190,
        "applied_at": 1522747126,
        "txn_amount": 3190,
        "txn_date": 1522747126,
        "txn_id": "txn_XpbG6h6Qo95l5Z3H",
        "txn_status": "success"
      }
    ],
    "net_term_days": 0,
    "object": "invoice",
    "paid_at": 1522747126,
    "price_type": "tax_exclusive",
    "recurring": true,
    "resource_version": 1522747126000,
    "round_off_amount": 0,
    "status": "paid",
    "sub_total": 3190,
    "subscription_id": "5SK0b4wlQo95kck8R",
    "tax": 0,
    "total": 3190,
    "updated_at": 1522747126,
    "write_off_amount": 0
  },
  "subscription": {
    "activated_at": 1522747124,
    "addons": [
      {
        "id": "data_usage",
        "object": "addon",
        "quantity": 2,
        "unit_price": 95
      }
    ],
    "billing_period": 1,
    "billing_period_unit": "month",
    "created_at": 1522747124,
    "currency_code": "USD",
    "current_term_end": 1525339126,
    "current_term_start": 1522747126,
    "customer_id": "5SK0b4wlQo95kck8R",
    "deleted": false,
    "due_invoices_count": 0,
    "has_scheduled_changes": false,
    "id": "5SK0b4wlQo95kck8R",
    "mrr": 0,
    "next_billing_at": 1525339126,
    "object": "subscription",
    "plan_free_quantity": 0,
    "plan_id": "no_trial",
    "plan_quantity": 3,
    "plan_unit_price": 1000,
    "resource_version": 1522747126000,
    "started_at": 1522747124,
    "status": "active",
    "updated_at": 1522747126
  }
}