tests/Unit/Api/Subscriptions/data/responses/subscription_without_advance_invoice_schedules.json

{
    "advance_invoice_schedules": [],
    "subscription": {
        "customer": {
            "allow_direct_debit": false,
            "auto_collection": "off",
            "card_status": "no_card",
            "created_at": 1622014982,
            "deleted": false,
            "excess_payments": 0,
            "first_name": "John",
            "id": "__test__XpbBsG2SYV7ZFJ2H",
            "last_name": "Doe",
            "net_term_days": 0,
            "object": "customer",
            "pii_cleared": "active",
            "preferred_currency_code": "USD",
            "promotional_credits": 0,
            "refundable_credits": 0,
            "resource_version": 1622014982000,
            "taxability": "taxable",
            "unbilled_charges": 0,
            "updated_at": 1622014982
        },
        "subscription": {
            "activated_at": 1622014983,
            "billing_period": 1,
            "billing_period_unit": "month",
            "created_at": 1622014983,
            "currency_code": "USD",
            "current_term_end": 1624693383,
            "current_term_start": 1622014983,
            "customer_id": "__test__XpbBsG2SYV7ZFJ2H",
            "deleted": false,
            "due_invoices_count": 1,
            "due_since": 1622014983,
            "has_scheduled_advance_invoices": false,
            "has_scheduled_changes": false,
            "id": "__test__XpbBsG2SYV7ZMB2K",
            "mrr": 0,
            "next_billing_at": 1624693383,
            "object": "subscription",
            "resource_version": 1622014983000,
            "started_at": 1622014983,
            "status": "active",
            "subscription_items": [
                {
                    "amount": 1000,
                    "free_quantity": 0,
                    "item_price_id": "basic-USD",
                    "item_type": "plan",
                    "object": "subscription_item",
                    "quantity": 1,
                    "unit_price": 1000
                }
            ],
            "total_dues": 1100,
            "updated_at": 1622014983
        }
    }
}